In [2]:
import pandas as pd
#series are not mutable

In [22]:
#series
#no chnage in orignial series
data=["mumbai","pune","banglore","nasik"]
#data=[1,2,3,4,"asf"]
ser=pd.Series(data)
print(ser)
print(ser[0])
ser[0]='asdf'
print(ser)

0      mumbai
1        pune
2    banglore
3       nasik
dtype: object
mumbai
0        asdf
1        pune
2    banglore
3       nasik
dtype: object

In [20]:
#slicing
print(ser[0:3])
print("_______________")
print(ser[1:4])

0    asdf
1       2
2       3
dtype: object
_______________
1    2
2    3
3    4
dtype: object

In [24]:
s3=ser.add("khargar")
#add the values like---original value+new vale
print(ser)
print(s3)

0        asdf
1        pune
2    banglore
3       nasik
dtype: object
0        asdfkhargar
1        punekhargar
2    banglorekhargar
3       nasikkhargar
dtype: object

In [30]:
s4=pd.Series(['vashi'])
s3=ser.append(s4,ignore_index=True)
print(s3)
print("-----------------------------")
print(ser)

0        asdf
1        pune
2    banglore
3       nasik
4       vashi
dtype: object
-----------------------------
0        asdf
1        pune
2    banglore
3       nasik
dtype: object

C:\Users\User\AppData\Local\Temp\ipykernel_26920\807318106.py:2: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  s3=ser.append(s4,ignore_index=True)

In [49]:
d=["mumbai","bgm","pune","pune"]
idx=["c1","c2","c3","c4"]
s11=pd.Series(d,idx)
s2=pd.Series(d)
print(s1)

c1    mumbai
c2       bgm
c3      pune
c4      pune
dtype: object

In [52]:
s4=pd.Series(['baner'])
s3=ser.append(s4,ignore_index=True)
print(s3)
print("-----------------------------")
print(s11)

0        asdf
1        pune
2    banglore
3       nasik
4       baner
dtype: object
-----------------------------
c1    mumbai
c2       bgm
c3      pune
c4      pune
dtype: object

C:\Users\User\AppData\Local\Temp\ipykernel_26920\800587629.py:2: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  s3=ser.append(s4,ignore_index=True)

In [54]:
s11.drop("c1")

c2     bgm
c3    pune
c4    pune
dtype: object

In [55]:
s11.replace("bgm","banglore")

c1      mumbai
c2    banglore
c3        pune
c4        pune
dtype: object

In [66]:
marks=(95,90,70,75)
m=pd.Series(marks)
m2=pd.Series(marks)
print("m2:",m2)
print(m)
print("_________________")
idx=(101,102,103,104)
m1=pd.Series(marks,idx)
print(m1)

m2: 0    95
1    90
2    70
3    75
dtype: int64
0    95
1    90
2    70
3    75
dtype: int64
_________________
101    95
102    90
103    70
104    75
dtype: int64

In [67]:
marks={"1":95,"2":87,"3":80}#key are index
m=pd.Series(marks)
print(m)

1    95
2    87
3    80
dtype: int64

In [92]:
rec={101:["shreya",60,70],102:["vaish",80,60]}
a=pd.Series(rec)
print(a)
for i,v in rec.items():
    for j in v:
        print(j)
        
print(suma)

101    [shreya, 60, 70]
102     [vaish, 80, 60]
dtype: object
shreya
60
70
vaish
80
60
['shreya', 60, 70, 'priya', 80, 60]

In [6]:
import numpy as np
import pandas as pd


p1=pd.Series(np.array(np.arange(10,20,2)))
print(p1)

0    10
1    12
2    14
3    16
4    18
dtype: int32

In [5]:
p2=pd.Series(np.array(np.arange(10,20,2)),index=list("abcde"))
print(p2)

a    10
b    12
c    14
d    16
e    18
dtype: int32

In [9]:
dict1={'book':40,'pen':30,'pencil':10}
p3=pd.Series(dict1)
print(p3)
print(p3['book'])

book      40
pen       30
pencil    10
dtype: int64
40

In [13]:
p3['pens']=5
print(p3)

book      40
pen        5
pencil    10
pens       5
dtype: int64

In [24]:
p2[1:4]
p3[0:3]
print(p3[-1:-4:-1])
print(p3['book':'pencil'])

pens       5
pencil    10
pen        5
dtype: int64
book      40
pen        5
pencil    10
dtype: int64

In [26]:
print("min",p1.min())
print("max",p1.max())
print("sum",p1.sum())

min 10
max 18
sum 70

In [37]:
dict2={"book":"Mr.X","pen":"Mr.Y","pencil":"Mr.A"}
p4=pd.Series(dict2)
print("min",p4.min())
print("max",p4.max())
print("sum",p4.sum())

min Mr.A
max Mr.Y
sum Mr.XMr.YMr.A

In [38]:
p1[5]=np.nan
print(p1)
print(p1.count())

0    10.0
1    12.0
2    14.0
3    16.0
4    18.0
5     NaN
dtype: float64
5

In [40]:
#drop particular obj-----doesnt change original 
newser=p4.drop("pencil")
print(newser)
print(p4)

book    Mr.X
pen     Mr.Y
dtype: object
book      Mr.X
pen       Mr.Y
pencil    Mr.A
dtype: object

In [41]:
p1.fillna(100)

0     10.0
1     12.0
2     14.0
3     16.0
4     18.0
5    100.0
dtype: float64

In [45]:
print(p1)

0    10.0
1    12.0
2    14.0
3    16.0
4    18.0
5     NaN
dtype: float64

In [47]:
#remove nan obj
#p1.dropna()
print(p1.dropna(inplace=True))#--change in original series

None

In [55]:
p1[1:3]=50
p1[4:5]=16

In [56]:
newp1=p1.mode()
print(newp1)

0    16.0
1    50.0
dtype: float64

In [57]:
p1.describe()

count     5.000000
mean     28.400000
std      19.869575
min      10.000000
25%      16.000000
50%      16.000000
75%      50.000000
max      50.000000
dtype: float64

In [58]:
p4.describe()

count        3
unique       3
top       Mr.X
freq         1
dtype: object

In [59]:
#fre of each ele
p1.value_counts()

50.0    2
16.0    2
10.0    1
dtype: int64

In [60]:
p1.sort_values()

0    10.0
3    16.0
4    16.0
1    50.0
2    50.0
dtype: float64

In [61]:
p1.sort_index()#---not in original

0    10.0
1    50.0
2    50.0
3    16.0
4    16.0
dtype: float64

In [62]:
p1.sort_values(ascending=False)

1    50.0
2    50.0
3    16.0
4    16.0
0    10.0
dtype: float64

In [84]:
ser1=pd.Series(chr(a) for a in range(ord('A'),ord('Z')+1,2))
print(ser1)

0     A
1     C
2     E
3     G
4     I
5     K
6     M
7     O
8     Q
9     S
10    U
11    W
12    Y
dtype: object

In [88]:
#dataframe
df1=pd.DataFrame(list(np.arange(ord('A'),ord('M'),2)),columns=['A'],index=[101,102,103,104,105,106])
print(df1)

      A
101  65
102  67
103  69
104  71
105  73
106  75

In [96]:
df2=pd.DataFrame({'EmpId':[101,102,103,104,105],'EmpNme':["shreya","nagma","vaish","pallavi","sakshi"],'Sal':[40000,50000,60000,70000,80000]},
                index=['a','b','c','d','e'])
print(df2)

   EmpId   EmpNme    Sal
a    101   shreya  40000
b    102    nagma  50000
c    103    vaish  60000
d    104  pallavi  70000
e    105   sakshi  80000

In [101]:
df2['EmpId']['e']

105

In [105]:
#loc
#loc[index label,col label]
df2.loc['d','EmpNme']

'pallavi'

In [107]:
df2.loc['b':'d','EmpNme':'Sal']

    EmpNme    Sal
b    nagma  50000
c    vaish  60000
d  pallavi  70000

In [112]:
df2.iloc[0:3]
print(df2.iloc[2:5,1:3])
print(df2.iloc[1:4,0:2])

    EmpNme    Sal
c    vaish  60000
d  pallavi  70000
e   sakshi  80000
   EmpId   EmpNme
b    102    nagma
c    103    vaish
d    104  pallavi

In [116]:
print(df2.loc['b':'d','EmpId':'EmpNme'])

   EmpId   EmpNme
b    102    nagma
c    103    vaish
d    104  pallavi

In [120]:
df2['bonus']=[1000,2000,3000,4000,5000]
print(df2)

   EmpId   EmpNme    Sal  bonus
a    101   shreya  40000   1000
b    102    nagma  50000   2000
c    103    vaish  60000   3000
d    104  pallavi  70000   4000
e    105   sakshi  80000   5000

In [125]:
#df2['inhand']=df2['Sal']+df2['bonus']
#print(df2)
df2['inhand']=df2.loc[:,'Sal':'bonus'].sum(axis=1)
print(df2)

   EmpId   EmpNme    Sal  bonus  inhand
a    101   shreya  40000   1000   41000
b    102    nagma  50000   2000   52000
c    103    vaish  60000   3000   63000
d    104  pallavi  70000   4000   74000
e    105   sakshi  80000   5000   85000

In [133]:
df2.rename(columns=({'EmpNme':'EmployeeName'}),inplace=True)
print(df2)

   EmpId EmployeeName    Sal  bonus  inhand
a    101       shreya  40000   1000   41000
b    102        nagma  50000   2000   52000
c    103        vaish  60000   3000   63000
d    104      pallavi  70000   4000   74000
e    105       sakshi  80000   5000   85000

In [134]:
df2.shape

(5, 5)

In [136]:
df2.shape[1]

5

In [138]:
df2.head(2)

   EmpId EmployeeName    Sal  bonus  inhand
a    101       shreya  40000   1000   41000
b    102        nagma  50000   2000   52000

In [143]:
df2.tail(2)

   EmpId EmployeeName    Sal  bonus  inhand
d    104      pallavi  70000   4000   74000
e    105       sakshi  80000   5000   85000

In [145]:
df2.describe()

            EmpId           Sal       bonus        inhand
count    5.000000      5.000000     5.00000      5.000000
mean   103.000000  60000.000000  3000.00000  63000.000000
std      1.581139  15811.388301  1581.13883  17392.527131
min    101.000000  40000.000000  1000.00000  41000.000000
25%    102.000000  50000.000000  2000.00000  52000.000000
50%    103.000000  60000.000000  3000.00000  63000.000000
75%    104.000000  70000.000000  4000.00000  74000.000000
max    105.000000  80000.000000  5000.00000  85000.000000

In [153]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, a to e
Data columns (total 6 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   EmpId         5 non-null      int64
 1   EmployeeName  5 non-null      object
 2   Sal           5 non-null      int64
 3   bonus         5 non-null      int64
 4   inhand        5 non-null      int64
 5   dept          5 non-null      object
dtypes: int64(4), object(2)
memory usage: 452.0+ bytes

In [154]:
df2.Sal.describe()

count        5.000000
mean     60000.000000
std      15811.388301
min      40000.000000
25%      50000.000000
50%      60000.000000
75%      70000.000000
max      80000.000000
Name: Sal, dtype: float64

In [155]:
df2.to_csv("worker details.csv")

In [151]:
df2['dept']=['it','sales','accounts','it','sales']

In [152]:
df2

   EmpId EmployeeName    Sal  bonus  inhand      dept
a    101       shreya  40000   1000   41000        it
b    102        nagma  50000   2000   52000     sales
c    103        vaish  60000   3000   63000  accounts
d    104      pallavi  70000   4000   74000        it
e    105       sakshi  80000   5000   85000     sales

In [158]:

df2['dept'].apply(lambda val:True if val=='it' else False)

a     True
b    False
c    False
d     True
e    False
Name: dept, dtype: bool

In [ ]:
=df2['designation']=df2['Sal'].apply(lambda)